AGSweeney/LEAP_Protocol/platforms/TI/LP-AM243/LEAP_LP-AM243/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM243x_ALX_beta" --part "ALX" --package "ALX" --context "r5fss0-0" --product "MCU_PLUS_SDK_AM243x@12.00.00"
 * @v2CliArgs --device "AM2434" --package "FCCSP (ALX)" --context "r5fss0-0" --product "MCU_PLUS_SDK_AM243x@12.00.00"
 * @versions {"tool":"1.21.2+3837"}
 */

/**
 * Import the modules used in this configuration.
 */
const eeprom     = scripting.addModule("/board/eeprom/eeprom", {}, false);
const eeprom1    = eeprom.addInstance();
const i2c        = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1       = i2c.addInstance();
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg    = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7  = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71 = mpu_armv7.addInstance();
const mpu_armv72 = mpu_armv7.addInstance();
const mpu_armv73 = mpu_armv7.addInstance();
const mpu_armv74 = mpu_armv7.addInstance();
const mpu_armv75 = mpu_armv7.addInstance();
const mpu_armv76 = mpu_armv7.addInstance();
const gpio       = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1      = gpio.addInstance();
const gpio2      = gpio.addInstance();
const gpio3      = gpio.addInstance();
const gpio4      = gpio.addInstance();
const gpio5      = gpio.addInstance();
const gpio6      = gpio.addInstance();
const gpio7      = gpio.addInstance();
const gpio8      = gpio.addInstance();
const gpio9      = gpio.addInstance();
const gpio10     = gpio.addInstance();
const gpio11     = gpio.addInstance();
const gpio12     = gpio.addInstance();
const gpio13     = gpio.addInstance();
const gpio14     = gpio.addInstance();
const gpio15     = gpio.addInstance();
const gpio16     = gpio.addInstance();
const enet_icss  = scripting.addModule("/networking/enet_icss/enet_icss", {}, false);
const enet_icss1 = enet_icss.addInstance();
const enet_icss2 = enet_icss.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
eeprom1.$name = "CONFIG_EEPROM0";

gpio1.$name                = "LEAP_GPIO_DO0";
gpio1.pinDir               = "OUTPUT";
gpio1.GPIO.gpioPin.$assign = "GPMC0_AD7";

gpio2.$name                = "LEAP_GPIO_DO1";
gpio2.pinDir               = "OUTPUT";
gpio2.GPIO.gpioPin.$assign = "GPMC0_AD11";

gpio3.$name                = "LEAP_GPIO_DO2";
gpio3.pinDir               = "OUTPUT";
gpio3.GPIO.gpioPin.$assign = "GPMC0_AD12";

gpio4.$name                = "LEAP_GPIO_DO3";
gpio4.pinDir               = "OUTPUT";
gpio4.GPIO.gpioPin.$assign = "GPMC0_AD3";

gpio5.$name                = "LEAP_GPIO_DO4";
gpio5.pinDir               = "OUTPUT";
gpio5.GPIO.gpioPin.$assign = "GPMC0_AD4";

gpio6.$name                = "LEAP_GPIO_DO5";
gpio6.pinDir               = "OUTPUT";
gpio6.GPIO.gpioPin.$assign = "GPMC0_AD5";

gpio7.$name                = "LEAP_GPIO_DO6";
gpio7.pinDir               = "OUTPUT";
gpio7.GPIO.gpioPin.$assign = "GPMC0_AD6";

gpio8.$name                = "LEAP_GPIO_DO7";
gpio8.pinDir               = "OUTPUT";
gpio8.GPIO.gpioPin.$assign = "GPMC0_AD8";

gpio9.$name                = "LEAP_GPIO_DI0";
gpio9.pinDir               = "INPUT";
gpio9.pu_pd                = "pu";
gpio9.GPIO.gpioPin.$assign = "UART0_CTSn";

gpio10.$name                = "LEAP_GPIO_DI1";
gpio10.pinDir               = "INPUT";
gpio10.pu_pd                = "pu";
gpio10.GPIO.gpioPin.$assign = "GPMC0_AD9";

gpio11.$name                = "LEAP_GPIO_DI2";
gpio11.pinDir               = "INPUT";
gpio11.pu_pd                = "pu";
gpio11.GPIO.gpioPin.$assign = "GPMC0_AD10";

gpio12.$name                = "LEAP_GPIO_DI3";
gpio12.pinDir               = "INPUT";
gpio12.pu_pd                = "pu";
gpio12.GPIO.gpioPin.$assign = "GPMC0_AD13";

gpio13.$name                = "LEAP_GPIO_DI4";
gpio13.pinDir               = "INPUT";
gpio13.pu_pd                = "pu";
gpio13.GPIO.gpioPin.$assign = "GPMC0_AD14";

gpio14.$name                = "LEAP_GPIO_DI5";
gpio14.pinDir               = "INPUT";
gpio14.pu_pd                = "pu";
gpio14.GPIO.gpioPin.$assign = "GPMC0_AD15";

gpio15.$name                = "LEAP_GPIO_DI6";
gpio15.pinDir               = "INPUT";
gpio15.pu_pd                = "pu";
gpio15.GPIO.gpioPin.$assign = "SPI0_CS1";

gpio16.$name                = "LEAP_GPIO_DI7";
gpio16.pinDir               = "INPUT";
gpio16.pu_pd                = "pu";
gpio16.GPIO.gpioPin.$assign = "SPI0_CLK";

i2c1.$name               = "CONFIG_I2C0";
eeprom1.peripheralDriver = i2c1;
i2c1.I2C.$assign         = "I2C0";
i2c1.I2C_child.$name     = "drivers_i2c_v0_i2c_v0_template1";

debug_log.enableUartLog        = true;
debug_log.enableCssLog         = false;
debug_log.uartLog.$name        = "CONFIG_UART0";
debug_log.uartLog.UART.$assign = "USART0";

const uart_v0_template  = scripting.addModule("/drivers/uart/v0/uart_v0_template", {}, false);
const uart_v0_template1 = uart_v0_template.addInstance({}, false);
uart_v0_template1.$name = "drivers_uart_v0_uart_v0_template0";
debug_log.uartLog.child = uart_v0_template1;

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x41010000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 23;

mpu_armv75.$name             = "CONFIG_MPU_REGION5";
mpu_armv75.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv75.baseAddr          = 0xA5000000;
mpu_armv75.size              = 23;
mpu_armv75.attributes        = "NonCached";

mpu_armv76.$name    = "CONFIG_MPU_REGION6";
mpu_armv76.size     = 27;
mpu_armv76.baseAddr = 0x60000000;

enet_icss1.$name                        = "CONFIG_ENET_ICSS0";
enet_icss1.phyToMacInterfaceMode        = "RGMII";
enet_icss1.QoS                          = 3;
enet_icss1.mdioMode                     = "MDIO_MODE_MANUAL";
enet_icss1.mode                         = "DUAL MAC";
enet_icss1.LargePoolPktCount            = 24;
enet_icss1.MediumPoolPktCount           = 24;
enet_icss1.SmallPoolPktCount            = 24;
enet_icss1.txDmaChannel[0].$name        = "ENET_DMA_TX_CH0";
enet_icss1.txDmaChannel[0].PacketsCount = 8;
enet_icss1.PRU_ICSSG1_RGMII1.$assign    = "PRU_ICSSG1_RGMII1";
enet_icss1.rxDmaChannel[0].$name        = "ENET_DMA_RX_CH0";
enet_icss1.rxDmaChannel[0].PacketsCount = 8;

const ethphy_cpsw_icssg  = scripting.addModule("/board/ethphy_cpsw_icssg/ethphy_cpsw_icssg", {}, false);
const ethphy_cpsw_icssg1 = ethphy_cpsw_icssg.addInstance({}, false);
ethphy_cpsw_icssg1.$name = "CONFIG_ENET_ETHPHY0";
enet_icss1.ethphy2       = ethphy_cpsw_icssg1;

enet_icss2.$name                        = "CONFIG_ENET_ICSS1";
enet_icss2.mode                         = "DUAL MAC";
enet_icss2.phyToMacInterfaceMode        = "RGMII";
enet_icss2.mdioMdcEnable                = false;
enet_icss2.dualMacPortSelected          = "ENET_MAC_PORT_2";
enet_icss2.QoS                          = 3;
enet_icss2.LargePoolPktCount            = 16;
enet_icss2.txDmaChannel[0].$name        = "ENET_DMA_TX_CH1";
enet_icss2.txDmaChannel[0].PacketsCount = 8;
enet_icss2.rxDmaChannel[0].$name        = "ENET_DMA_RX_CH1";
enet_icss2.rxDmaChannel[0].PacketsCount = 8;

const ethphy_cpsw_icssg2 = ethphy_cpsw_icssg.addInstance({}, false);
ethphy_cpsw_icssg2.$name = "CONFIG_ENET_ETHPHY1";
enet_icss2.ethphy3       = ethphy_cpsw_icssg2;

const pruicss                            = scripting.addModule("/drivers/pruicss/pruicss", {}, false);
const pruicss1                           = pruicss.addInstance({}, false);
enet_icss2.icss                          = pruicss1;
enet_icss1.icss                          = pruicss1;
pruicss1.$name                           = "CONFIG_PRU_ICSS0";
pruicss1.AdditionalICSSSettings[0].$name = "CONFIG_PRU_ICSS_IO1";
pruicss1.intcMapping.create(1);
pruicss1.intcMapping[0].$name            = "CONFIG_ICSS1_INTC_MAPPING0";
pruicss1.intcMapping[0].event            = "41";
pruicss1.intcMapping[0].channel          = "7";
pruicss1.intcMapping[0].host             = "8";

const udma         = scripting.addModule("/drivers/udma/udma", {}, false);
const udma1        = udma.addInstance({}, false);
enet_icss2.udmaDrv = udma1;
enet_icss1.udmaDrv = udma1;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
gpio1.GPIO.gpioPin.$suggestSolution                      = "GPIO1_12";
gpio2.GPIO.gpioPin.$suggestSolution                      = "GPIO1_18";
gpio3.GPIO.gpioPin.$suggestSolution                      = "GPIO1_19";
gpio4.GPIO.gpioPin.$suggestSolution                      = "GPIO0_50";
gpio5.GPIO.gpioPin.$suggestSolution                      = "GPIO1_6";
gpio6.GPIO.gpioPin.$suggestSolution                      = "GPIO0_1";
gpio7.GPIO.gpioPin.$suggestSolution                      = "GPIO0_78";
gpio8.GPIO.gpioPin.$suggestSolution                      = "GPIO1_33";
gpio9.GPIO.gpioPin.$suggestSolution                      = "GPIO1_8";
gpio10.GPIO.gpioPin.$suggestSolution                     = "GPIO1_20";
gpio11.GPIO.gpioPin.$suggestSolution                     = "GPIO1_36";
gpio12.GPIO.gpioPin.$suggestSolution                     = "GPIO1_35";
gpio13.GPIO.gpioPin.$suggestSolution                     = "GPIO1_40";
gpio14.GPIO.gpioPin.$suggestSolution                     = "GPIO1_41";
gpio15.GPIO.gpioPin.$suggestSolution                     = "GPIO0_88";
gpio16.GPIO.gpioPin.$suggestSolution                     = "GPIO1_5";
i2c1.I2C.SCL.$suggestSolution                            = "I2C0_SCL";
i2c1.I2C.SDA.$suggestSolution                            = "I2C0_SDA";
debug_log.uartLog.UART.RXD.$suggestSolution              = "UART0_RXD";
debug_log.uartLog.UART.TXD.$suggestSolution              = "UART0_TXD";
enet_icss1.PRU_ICSSG1_MDIO.$suggestSolution              = "PRU_ICSSG1_MDIO0";
enet_icss1.PRU_ICSSG1_MDIO.MDC.$suggestSolution          = "PRG1_MDIO0_MDC";
enet_icss1.PRU_ICSSG1_MDIO.MDIO.$suggestSolution         = "PRG1_MDIO0_MDIO";
enet_icss1.PRU_ICSSG1_IEP.$suggestSolution               = "PRU_ICSSG1_IEP0";
enet_icss1.PRU_ICSSG1_IEP.EDC_LATCH_IN0.$suggestSolution = "PRG1_PRU0_GPO18";
enet_icss1.PRU_ICSSG1_IEP.EDC_SYNC_OUT0.$suggestSolution = "PRG1_PRU0_GPO19";
enet_icss1.PRU_ICSSG1_RGMII1.RD0.$suggestSolution        = "PRG1_PRU0_GPO0";
enet_icss1.PRU_ICSSG1_RGMII1.RD1.$suggestSolution        = "PRG1_PRU0_GPO1";
enet_icss1.PRU_ICSSG1_RGMII1.RD2.$suggestSolution        = "PRG1_PRU0_GPO2";
enet_icss1.PRU_ICSSG1_RGMII1.RD3.$suggestSolution        = "PRG1_PRU0_GPO3";
enet_icss1.PRU_ICSSG1_RGMII1.RXC.$suggestSolution        = "PRG1_PRU0_GPO6";
enet_icss1.PRU_ICSSG1_RGMII1.RX_CTL.$suggestSolution     = "PRG1_PRU0_GPO4";
enet_icss1.PRU_ICSSG1_RGMII1.TD0.$suggestSolution        = "PRG1_PRU0_GPO11";
enet_icss1.PRU_ICSSG1_RGMII1.TD1.$suggestSolution        = "PRG1_PRU0_GPO12";
enet_icss1.PRU_ICSSG1_RGMII1.TD2.$suggestSolution        = "PRG1_PRU0_GPO13";
enet_icss1.PRU_ICSSG1_RGMII1.TD3.$suggestSolution        = "PRG1_PRU0_GPO14";
enet_icss1.PRU_ICSSG1_RGMII1.TXC.$suggestSolution        = "PRG1_PRU0_GPO16";
enet_icss1.PRU_ICSSG1_RGMII1.TX_CTL.$suggestSolution     = "PRG1_PRU0_GPO15";
enet_icss2.PRU_ICSSG1_RGMII2.$suggestSolution            = "PRU_ICSSG1_RGMII2";
enet_icss2.PRU_ICSSG1_RGMII2.RD0.$suggestSolution        = "PRG1_PRU1_GPO0";
enet_icss2.PRU_ICSSG1_RGMII2.RD1.$suggestSolution        = "PRG1_PRU1_GPO1";
enet_icss2.PRU_ICSSG1_RGMII2.RD2.$suggestSolution        = "PRG1_PRU1_GPO2";
enet_icss2.PRU_ICSSG1_RGMII2.RD3.$suggestSolution        = "PRG1_PRU1_GPO3";
enet_icss2.PRU_ICSSG1_RGMII2.RXC.$suggestSolution        = "PRG1_PRU1_GPO6";
enet_icss2.PRU_ICSSG1_RGMII2.RX_CTL.$suggestSolution     = "PRG1_PRU1_GPO4";
enet_icss2.PRU_ICSSG1_RGMII2.TD0.$suggestSolution        = "PRG1_PRU1_GPO11";
enet_icss2.PRU_ICSSG1_RGMII2.TD1.$suggestSolution        = "PRG1_PRU1_GPO12";
enet_icss2.PRU_ICSSG1_RGMII2.TD2.$suggestSolution        = "PRG1_PRU1_GPO13";
enet_icss2.PRU_ICSSG1_RGMII2.TD3.$suggestSolution        = "PRG1_PRU1_GPO14";
enet_icss2.PRU_ICSSG1_RGMII2.TXC.$suggestSolution        = "PRG1_PRU1_GPO16";
enet_icss2.PRU_ICSSG1_RGMII2.TX_CTL.$suggestSolution     = "PRG1_PRU1_GPO15";
